?- t(swiprolog, queens11, 1, 5869).
object_size(queens11, 42824).
?- t(swiprolog, crypt, 1000, 8740).
object_size(crypt, 146212).
?- t(swiprolog, primes, 10000, 7259).
object_size(primes, 6428).
?- t(swiprolog, tak, 1000, 74750).
object_size(tak, 25308).
?- t(swiprolog, deriv, 10000, 339).
object_size(deriv, 46644).
?- t(swiprolog, poly, 100, 1999).
object_size(poly, 112704).
?- t(swiprolog, qsort, 10000, 2619).
object_size(qsort, 76560).
?- ^  Exception: (6,847) _G23779 is 2.80779e+307*13 ? EOF: exit
object_size(exp, 28284).
?- t(swiprolog, fib, 1000, 1510).
object_size(fib, 18240).
?- t(swiprolog, knights, 1, 2800).
object_size(knights, 39016).
