Ciao-Prolog 1.7 #93: Mon Jun 18 12:11:12 CEST 2001
?- use_module('/home/susana/tesis/micodigo/cneg/queens.pl').
{Reading /home/susana/tesis/micodigo/cneg/queens.pl
ERROR: (lns 1-2) Bad module queens_standard in module declaration
}

yes
?-  use_module('/home/susana/tesis/micodigo/cneg/queens.pl').

yes
?- queens(N,Q).

N = 0,
Q = [] ? ;
{ERROR: illegal arithmetic expression}

no
?- queens(1,Q).

Q = [1] ? ;

no
?- queens(2,Q).

no
?- queens(3,Q).

no
?- queens(4,Q).

Q = [2,4,1,3] ? ;

Q = [3,1,4,2] ? ;

no
?- queens(5,Q).

Q = [2,4,1,3,5] ? ;

Q = [3,1,4,2,5] ? ;

Q = [1,3,5,2,4] ? ;

Q = [2,5,3,1,4] ? ;

Q = [1,4,2,5,3] ? ;

Q = [5,2,4,1,3] ? ;

Q = [4,1,3,5,2] ? ;

Q = [5,3,1,4,2] ? ;

Q = [3,5,2,4,1] ? ;

Q = [4,2,5,3,1] ? ;

no
?- queens(6,Q).

Q = [2,4,6,1,3,5] ? ;

Q = [3,6,2,5,1,4] ? ;

Q = [4,1,5,2,6,3] ? ;

Q = [5,3,1,6,4,2] ? ;

no
?- queens(7,Q).

Q = [2,4,6,1,3,5,7] ? ;

Q = [3,6,2,5,1,4,7] ? ;

Q = [4,1,5,2,6,3,7] ? ;

Q = [5,3,1,6,4,2,7] ? ;

Q = [2,5,3,1,7,4,6] ? ;

Q = [1,3,5,7,2,4,6] ? ;

Q = [2,5,1,4,7,3,6] ? ;

Q = [2,4,1,7,5,3,6] ? ;

Q = [2,5,7,4,1,3,6] ? ;

Q = [3,7,4,1,5,2,6] ? ;

Q = [4,2,7,5,3,1,6] ? ;

Q = [4,1,3,6,2,7,5] ? ;

Q = [3,1,6,4,2,7,5] ? ;

Q = [7,2,4,6,1,3,5] ? ;

Q = [1,4,7,3,6,2,5] ? ;

Q = [3,7,2,4,6,1,5] ? ;

Q = [2,6,3,7,4,1,5] ? ;

Q = [3,1,6,2,5,7,4] ? ;

Q = [1,5,2,6,3,7,4] ? ;

Q = [2,7,5,3,1,6,4] ? ;

Q = [6,1,3,5,7,2,4] ? ;

Q = [7,3,6,2,5,1,4] ? ;

Q = [5,7,2,6,3,1,4] ? ;

Q = [6,2,5,1,4,7,3] ? ;

Q = [5,1,6,4,2,7,3] ? ;

Q = [7,4,1,5,2,6,3] ? ;

Q = [1,6,4,2,7,5,3] ? ;

Q = [5,7,2,4,6,1,3] ? ;

Q = [4,7,5,2,6,1,3] ? ;

Q = [4,6,1,3,5,7,2] ? ;

Q = [5,1,4,7,3,6,2] ? ;

Q = [6,3,1,4,7,5,2] ? ;

Q = [6,4,7,1,3,5,2] ? ;

Q = [6,3,7,4,1,5,2] ? ;

Q = [7,5,3,1,6,4,2] ? ;

Q = [6,3,5,7,1,4,2] ? ;

Q = [3,5,7,2,4,6,1] ? ;

Q = [4,7,3,6,2,5,1] ? ;

Q = [5,2,6,3,7,4,1] ? ;

Q = [6,4,2,7,5,3,1] ? ;

no
?- queens(8,Q).

Q = [5,7,2,6,3,1,4,8] ? ;

Q = [4,7,5,2,6,1,3,8] ? ;

Q = [6,4,7,1,3,5,2,8] ? ;

Q = [6,3,5,7,1,4,2,8] ? ;

Q = [4,2,8,6,1,3,5,7] ? 

yes
?- 
